package test;

public class 연습장4 {
		
		/*  화폐 매수 구하기
		 *  금액 : 537620
		 *  50000 : 10개
		 *  10000 : 3개
		 *  5000 : 1개
		 *  1000 : 2개
		 *  500 : 1개
		 *  100 : 1개
		 *  50 : 0개
		 *  10 : 2개
		 *  5 : 0개
		 *  1 : 0개
		 *  위와 같이 금액을 입력하면,
		 *  큰 화폐단위부터 계산하여, 화폐단위별로 화폐 매수를
		 *  출력하는 프로그램을 작성하시오.
		 */
	
	
	/* (순서도)
	 * 1. 필요한 변수 선언
	 *   - (입력금액), (화폐매수), (화폐단위)
	 *   - int money[] = {50000, 10000, 5000, 1000, ...);
	 *   
	 * 2. (입력금액) 입력
	 * 
	 * 3. 화폐매수 계산
	 * [조건] : 큰 화폐단위부터 계산한다.
	 * 3-1. 화폐매수 계산
	 *   10 = 537620 / 50000
	 *   
	 *   (화폐매수) = (입력금액) / (화폐단위)
	 * 
	 */
		
	}

}
